Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/atdf/PIC32MZ2025DAA176.atdf
         <register caption="Priority Shadow Select Register" name="PRISS" offset="0x10" rw="RW" size="4">
            <bitfield caption="Single Vector Shadow Register Set bit" mask="0x00000001" name="SS0" values="PRISS__SS0" />
            <bitfield caption="Interrupt with Priority Level 1 Shadow Set bits (1)" mask="0x000000F0" name="PRI1SS" values="PRISS__PRI1SS" />
            <bitfield caption="Interrupt with Priority Level 2 Shadow Set bits (1)" mask="0x00000F00" name="PRI2SS" values="PRISS__PRI2SS" />
            <bitfield caption="Interrupt with Priority Level 3 Shadow Set bits (1)" mask="0x0000F000" name="PRI3SS" values="PRISS__PRI3SS" />
            <bitfield caption="Interrupt with Priority Level 4 Shadow Set bits (1)" mask="0x000F0000" name="PRI4SS" values="PRISS__PRI4SS" />
            <bitfield caption="Interrupt with Priority Level 5 Shadow Set bits (1)" mask="0x00F00000" name="PRI5SS" values="PRISS__PRI5SS" />
            <bitfield caption="Interrupt with Priority Level 6 Shadow Set bits (1)" mask="0x0F000000" name="PRI6SS" values="PRISS__PRI6SS" />
            <bitfield caption="Interrupt with Priority Level 7 Shadow Set bits (1)" mask="0xF0000000" name="PRI7SS" values="PRISS__PRI7SS" />
         </register>
         <register caption="Interrupt Status Register" name="INTSTAT" offset="0x20" rw="R" size="4">
            <bitfield mask="0x000000FF" name="SIRQ" />
            <bitfield mask="0x00000700" name="SRIPL" />
         </register>
         <register caption="Interrupt Proximity Timer Register" name="IPTMR" offset="0x30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="IPTMR" />
         </register>
         <register caption="" name="IFS0" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CTIF" />
            <bitfield mask="0x00000002" name="CS0IF" />
            <bitfield mask="0x00000004" name="CS1IF" />
            <bitfield mask="0x00000008" name="INT0IF" />
            <bitfield mask="0x00000010" name="T1IF" />
            <bitfield mask="0x00000020" name="IC1EIF" />
            <bitfield mask="0x00000040" name="IC1IF" />
            <bitfield mask="0x00000080" name="OC1IF" />
            <bitfield mask="0x00000100" name="INT1IF" />
            <bitfield mask="0x00000200" name="T2IF" />
            <bitfield mask="0x00000400" name="IC2EIF" />
            <bitfield mask="0x00000800" name="IC2IF" />
            <bitfield mask="0x00001000" name="OC2IF" />
            <bitfield mask="0x00002000" name="INT2IF" />
            <bitfield mask="0x00004000" name="T3IF" />
            <bitfield mask="0x00008000" name="IC3EIF" />
            <bitfield mask="0x00010000" name="IC3IF" />
            <bitfield mask="0x00020000" name="OC3IF" />
            <bitfield mask="0x00040000" name="INT3IF" />
            <bitfield mask="0x00080000" name="T4IF" />
            <bitfield mask="0x00100000" name="IC4EIF" />
            <bitfield mask="0x00200000" name="IC4IF" />
            <bitfield mask="0x00400000" name="OC4IF" />
            <bitfield mask="0x00800000" name="INT4IF" />
            <bitfield mask="0x01000000" name="T5IF" />
            <bitfield mask="0x02000000" name="IC5EIF" />
            <bitfield mask="0x04000000" name="IC5IF" />
            <bitfield mask="0x08000000" name="OC5IF" />
            <bitfield mask="0x10000000" name="T6IF" />
            <bitfield mask="0x20000000" name="IC6EIF" />
            <bitfield mask="0x40000000" name="IC6IF" />
            <bitfield mask="0x80000000" name="OC6IF" />
         </register>
         <register caption="" name="IFS1" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x00000001" name="T7IF" />
            <bitfield mask="0x00000002" name="IC7EIF" />
            <bitfield mask="0x00000004" name="IC7IF" />
            <bitfield mask="0x00000008" name="OC7IF" />
            <bitfield mask="0x00000010" name="T8IF" />
            <bitfield mask="0x00000020" name="IC8EIF" />
            <bitfield mask="0x00000040" name="IC8IF" />
            <bitfield mask="0x00000080" name="OC8IF" />
            <bitfield mask="0x00000100" name="T9IF" />
            <bitfield mask="0x00000200" name="IC9EIF" />
            <bitfield mask="0x00000400" name="IC9IF" />
            <bitfield mask="0x00000800" name="OC9IF" />
            <bitfield mask="0x00001000" name="ADCIF" />
            <bitfield mask="0x00002000" name="ADCFIFOIF" />
            <bitfield mask="0x00004000" name="ADCDC1IF" />
            <bitfield mask="0x00008000" name="ADCDC2IF" />
            <bitfield mask="0x00010000" name="ADCDC3IF" />
            <bitfield mask="0x00020000" name="ADCDC4IF" />
            <bitfield mask="0x00040000" name="ADCDC5IF" />
            <bitfield mask="0x00080000" name="ADCDC6IF" />
            <bitfield mask="0x00100000" name="ADCDF1IF" />
            <bitfield mask="0x00200000" name="ADCDF2IF" />
            <bitfield mask="0x00400000" name="ADCDF3IF" />
            <bitfield mask="0x00800000" name="ADCDF4IF" />
            <bitfield mask="0x01000000" name="ADCDF5IF" />
            <bitfield mask="0x02000000" name="ADCDF6IF" />
            <bitfield mask="0x04000000" name="ADCFLTIF" />
            <bitfield mask="0x08000000" name="ADCD0IF" />
            <bitfield mask="0x10000000" name="ADCD1IF" />
            <bitfield mask="0x20000000" name="ADCD2IF" />
            <bitfield mask="0x40000000" name="ADCD3IF" />
            <bitfield mask="0x80000000" name="ADCD4IF" />
         </register>
         <register caption="" name="IFS2" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ADCD5IF" />
            <bitfield mask="0x00000002" name="ADCD6IF" />
            <bitfield mask="0x00000004" name="ADCD7IF" />
            <bitfield mask="0x00000008" name="ADCD8IF" />
            <bitfield mask="0x00000010" name="ADCD9IF" />
            <bitfield mask="0x00000020" name="ADCD10IF" />
            <bitfield mask="0x00000040" name="ADCD11IF" />
            <bitfield mask="0x00000080" name="ADCD12IF" />
            <bitfield mask="0x00000100" name="ADCD13IF" />
            <bitfield mask="0x00000200" name="ADCD14IF" />
            <bitfield mask="0x00000400" name="ADCD15IF" />
            <bitfield mask="0x00000800" name="ADCD16IF" />
            <bitfield mask="0x00001000" name="ADCD17IF" />
            <bitfield mask="0x00002000" name="ADCD18IF" />
            <bitfield mask="0x00004000" name="ADCD19IF" />
            <bitfield mask="0x00008000" name="ADCD20IF" />
            <bitfield mask="0x00010000" name="ADCD21IF" />
            <bitfield mask="0x00020000" name="ADCD22IF" />
            <bitfield mask="0x00040000" name="ADCD23IF" />
            <bitfield mask="0x00080000" name="ADCD24IF" />
            <bitfield mask="0x00100000" name="ADCD25IF" />
            <bitfield mask="0x00200000" name="ADCD26IF" />
            <bitfield mask="0x00400000" name="ADCD27IF" />
            <bitfield mask="0x00800000" name="ADCD28IF" />
            <bitfield mask="0x01000000" name="ADCD29IF" />
            <bitfield mask="0x02000000" name="ADCD30IF" />
            <bitfield mask="0x04000000" name="ADCD31IF" />
            <bitfield mask="0x08000000" name="ADCD32IF" />
            <bitfield mask="0x10000000" name="ADCD33IF" />
            <bitfield mask="0x20000000" name="ADCD34IF" />
            <bitfield mask="0x40000000" name="ADCD35IF" />
            <bitfield mask="0x80000000" name="ADCD36IF" />
         </register>
         <register caption="" name="IFS3" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ADCD37IF" />
            <bitfield mask="0x00000002" name="ADCD38IF" />
            <bitfield mask="0x00000004" name="ADCD39IF" />
            <bitfield mask="0x00000008" name="ADCD40IF" />
            <bitfield mask="0x00000010" name="ADCD41IF" />
            <bitfield mask="0x00000020" name="ADCD42IF" />
            <bitfield mask="0x00000040" name="ADCD43IF" />
            <bitfield mask="0x00000100" name="CPCIF" />
            <bitfield mask="0x00000200" name="CFDCIF" />
            <bitfield mask="0x00000400" name="SBIF" />
            <bitfield mask="0x00000800" name="CRPTIF" />
            <bitfield mask="0x00002000" name="SPI1EIF" />
            <bitfield mask="0x00004000" name="SPI1RXIF" />
            <bitfield mask="0x00008000" name="SPI1TXIF" />
            <bitfield mask="0x00010000" name="U1EIF" />
            <bitfield mask="0x00020000" name="U1RXIF" />
            <bitfield mask="0x00040000" name="U1TXIF" />
            <bitfield mask="0x00080000" name="I2C1BIF" />
            <bitfield mask="0x00100000" name="I2C1SIF" />
            <bitfield mask="0x00200000" name="I2C1MIF" />
            <bitfield mask="0x00400000" name="CNAIF" />
            <bitfield mask="0x00800000" name="CNBIF" />
            <bitfield mask="0x01000000" name="CNCIF" />
            <bitfield mask="0x02000000" name="CNDIF" />
            <bitfield mask="0x04000000" name="CNEIF" />
            <bitfield mask="0x08000000" name="CNFIF" />
            <bitfield mask="0x10000000" name="CNGIF" />
            <bitfield mask="0x20000000" name="CNHIF" />
            <bitfield mask="0x40000000" name="CNJIF" />
            <bitfield mask="0x80000000" name="CNKIF" />
         </register>
         <register caption="" name="IFS4" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00000001" name="PMPIF" />
            <bitfield mask="0x00000002" name="PMPEIF" />
            <bitfield mask="0x00000004" name="CMP1IF" />
            <bitfield mask="0x00000008" name="CMP2IF" />
            <bitfield mask="0x00000010" name="USBIF" />
            <bitfield mask="0x00000020" name="USBDMAIF" />
            <bitfield mask="0x00000040" name="DMA0IF" />
            <bitfield mask="0x00000080" name="DMA1IF" />
            <bitfield mask="0x00000100" name="DMA2IF" />
            <bitfield mask="0x00000200" name="DMA3IF" />
            <bitfield mask="0x00000400" name="DMA4IF" />
            <bitfield mask="0x00000800" name="DMA5IF" />
            <bitfield mask="0x00001000" name="DMA6IF" />
            <bitfield mask="0x00002000" name="DMA7IF" />
            <bitfield mask="0x00004000" name="SPI2EIF" />
            <bitfield mask="0x00008000" name="SPI2RXIF" />
            <bitfield mask="0x00010000" name="SPI2TXIF" />
            <bitfield mask="0x00020000" name="U2EIF" />
            <bitfield mask="0x00040000" name="U2RXIF" />
            <bitfield mask="0x00080000" name="U2TXIF" />
            <bitfield mask="0x00100000" name="I2C2BIF" />
            <bitfield mask="0x00200000" name="I2C2SIF" />
            <bitfield mask="0x00400000" name="I2C2MIF" />
            <bitfield mask="0x00800000" name="CAN1IF" />
            <bitfield mask="0x01000000" name="CAN2IF" />
            <bitfield mask="0x02000000" name="ETHIF" />
            <bitfield mask="0x04000000" name="SPI3EIF" />
            <bitfield mask="0x08000000" name="SPI3RXIF" />
            <bitfield mask="0x10000000" name="SPI3TXIF" />
            <bitfield mask="0x20000000" name="U3EIF" />
            <bitfield mask="0x40000000" name="U3RXIF" />
            <bitfield mask="0x80000000" name="U3TXIF" />
         </register>
         <register caption="" name="IFS5" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000001" name="I2C3BIF" />
            <bitfield mask="0x00000002" name="I2C3SIF" />
            <bitfield mask="0x00000004" name="I2C3MIF" />
            <bitfield mask="0x00000008" name="SPI4EIF" />
            <bitfield mask="0x00000010" name="SPI4RXIF" />
            <bitfield mask="0x00000020" name="SPI4TXIF" />
            <bitfield mask="0x00000040" name="RTCCIF" />
            <bitfield mask="0x00000080" name="FCEIF" />
            <bitfield mask="0x00000100" name="PREIF" />
            <bitfield mask="0x00000200" name="SQI1IF" />
            <bitfield mask="0x00000400" name="U4EIF" />
            <bitfield mask="0x00000800" name="U4RXIF" />
            <bitfield mask="0x00001000" name="U4TXIF" />
            <bitfield mask="0x00002000" name="I2C4BIF" />
            <bitfield mask="0x00004000" name="I2C4SIF" />
            <bitfield mask="0x00008000" name="I2C4MIF" />
            <bitfield mask="0x00010000" name="SPI5EIF" />
            <bitfield mask="0x00020000" name="SPI5RXIF" />
            <bitfield mask="0x00040000" name="SPI5TXIF" />
            <bitfield mask="0x00080000" name="U5EIF" />
            <bitfield mask="0x00100000" name="U5RXIF" />
            <bitfield mask="0x00200000" name="U5TXIF" />
            <bitfield mask="0x00400000" name="I2C5BIF" />
            <bitfield mask="0x00800000" name="I2C5SIF" />
            <bitfield mask="0x01000000" name="I2C5MIF" />
            <bitfield mask="0x02000000" name="SPI6IF" />
            <bitfield mask="0x04000000" name="SPI6RXIF" />
            <bitfield mask="0x08000000" name="SPI6TX" />
            <bitfield mask="0x10000000" name="U6EIF" />
            <bitfield mask="0x20000000" name="U6RXIF" />
            <bitfield mask="0x40000000" name="U6TXIF" />
            <bitfield mask="0x80000000" name="SDHCIF" />
         </register>
         <register caption="" name="IFS6" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="GLCDIF" />
            <bitfield mask="0x00000002" name="GPUIF" />
            <bitfield mask="0x00000008" name="CTMUIF" />
            <bitfield mask="0x00000010" name="ADCEOSIF" />
            <bitfield mask="0x00000020" name="ADCARDYIF" />
            <bitfield mask="0x00000040" name="ADCURDYIF" />
            <bitfield mask="0x00000080" name="ADC0EIF" />
            <bitfield mask="0x00000100" name="ADC1EIF" />
            <bitfield mask="0x00000200" name="ADC2EIF" />
            <bitfield mask="0x00000400" name="ADC3EIF" />
            <bitfield mask="0x00000800" name="ADC4EIF" />
            <bitfield mask="0x00002000" name="ADCGRPIF" />
            <bitfield mask="0x00004000" name="ADC7EIF" />
            <bitfield mask="0x00008000" name="ADC0WIF" />
            <bitfield mask="0x00010000" name="ADC1WIF" />
            <bitfield mask="0x00020000" name="ADC2WIF" />
            <bitfield mask="0x00040000" name="ADC3WIF" />
            <bitfield mask="0x00080000" name="ADC4WIF" />
            <bitfield mask="0x00400000" name="ADC7WIF" />
            <bitfield mask="0x00800000" name="MPLLFLTIF" />
         </register>
         <register caption="" name="IEC0" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CTIE" />
            <bitfield mask="0x00000002" name="CS0IE" />
            <bitfield mask="0x00000004" name="CS1IE" />
            <bitfield mask="0x00000008" name="INT0IE" />
            <bitfield mask="0x00000010" name="T1IE" />
            <bitfield mask="0x00000020" name="IC1EIE" />
            <bitfield mask="0x00000040" name="IC1IE" />
            <bitfield mask="0x00000080" name="OC1IE" />
            <bitfield mask="0x00000100" name="INT1IE" />
            <bitfield mask="0x00000200" name="T2IE" />
            <bitfield mask="0x00000400" name="IC2EIE" />
            <bitfield mask="0x00000800" name="IC2IE" />
            <bitfield mask="0x00001000" name="OC2IE" />
            <bitfield mask="0x00002000" name="INT2IE" />
            <bitfield mask="0x00004000" name="T3IE" />
            <bitfield mask="0x00008000" name="IC3EIE" />
            <bitfield mask="0x00010000" name="IC3IE" />
            <bitfield mask="0x00020000" name="OC3IE" />
            <bitfield mask="0x00040000" name="INT3IE" />
            <bitfield mask="0x00080000" name="T4IE" />
            <bitfield mask="0x00100000" name="IC4EIE" />
            <bitfield mask="0x00200000" name="IC4IE" />
            <bitfield mask="0x00400000" name="OC4IE" />
            <bitfield mask="0x00800000" name="INT4IE" />
            <bitfield mask="0x01000000" name="T5IE" />
            <bitfield mask="0x02000000" name="IC5EIE" />
            <bitfield mask="0x04000000" name="IC5IE" />
            <bitfield mask="0x08000000" name="OC5IE" />
            <bitfield mask="0x10000000" name="T6IE" />
            <bitfield mask="0x20000000" name="IC6EIE" />
            <bitfield mask="0x40000000" name="IC6IE" />
            <bitfield mask="0x80000000" name="OC6IE" />
         </register>
         <register caption="" name="IEC1" offset="0xd0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="T7IE" />
            <bitfield mask="0x00000002" name="IC7EIE" />
            <bitfield mask="0x00000004" name="IC7IE" />
            <bitfield mask="0x00000008" name="OC7IE" />
            <bitfield mask="0x00000010" name="T8IE" />
            <bitfield mask="0x00000020" name="IC8EIE" />
            <bitfield mask="0x00000040" name="IC8IE" />
            <bitfield mask="0x00000080" name="OC8IE" />
            <bitfield mask="0x00000100" name="T9IE" />
            <bitfield mask="0x00000200" name="IC9EIE" />
            <bitfield mask="0x00000400" name="IC9IE" />
            <bitfield mask="0x00000800" name="OC9IE" />
            <bitfield mask="0x00001000" name="ADCIE" />
            <bitfield mask="0x00002000" name="ADCFIFOIE" />
            <bitfield mask="0x00004000" name="ADCDC1IE" />
            <bitfield mask="0x00008000" name="ADCDC2IE" />
            <bitfield mask="0x00010000" name="ADCDC3IE" />
            <bitfield mask="0x00020000" name="ADCDC4IE" />
            <bitfield mask="0x00040000" name="ADCDC5IE" />
            <bitfield mask="0x00080000" name="ADCDC6IE" />
            <bitfield mask="0x00100000" name="ADCDF1IE" />
            <bitfield mask="0x00200000" name="ADCDF2IE" />
            <bitfield mask="0x00400000" name="ADCDF3IE" />
            <bitfield mask="0x00800000" name="ADCDF4IE" />
            <bitfield mask="0x01000000" name="ADCDF5IE" />
            <bitfield mask="0x02000000" name="ADCDF6IE" />
            <bitfield mask="0x04000000" name="ADCFLTIE" />
            <bitfield mask="0x08000000" name="ADCD0IE" />
            <bitfield mask="0x10000000" name="ADCD1IE" />
            <bitfield mask="0x20000000" name="ADCD2IE" />
            <bitfield mask="0x40000000" name="ADCD3IE" />
            <bitfield mask="0x80000000" name="ADCD4IE" />
         </register>
         <register caption="" name="IEC2" offset="0xe0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ADCD5IE" />
            <bitfield mask="0x00000002" name="ADCD6IE" />
            <bitfield mask="0x00000004" name="ADCD7IE" />
            <bitfield mask="0x00000008" name="ADCD8IE" />
            <bitfield mask="0x00000010" name="ADCD9IE" />
            <bitfield mask="0x00000020" name="ADCD10IE" />
            <bitfield mask="0x00000040" name="ADCD11IE" />
            <bitfield mask="0x00000080" name="ADCD12IE" />
            <bitfield mask="0x00000100" name="ADCD13IE" />
            <bitfield mask="0x00000200" name="ADCD14IE" />
            <bitfield mask="0x00000400" name="ADCD15IE" />
            <bitfield mask="0x00000800" name="ADCD16IE" />
            <bitfield mask="0x00001000" name="ADCD17IE" />
            <bitfield mask="0x00002000" name="ADCD18IE" />
            <bitfield mask="0x00004000" name="ADCD19IE" />
            <bitfield mask="0x00008000" name="ADCD20IE" />
            <bitfield mask="0x00010000" name="ADCD21IE" />
            <bitfield mask="0x00020000" name="ADCD22IE" />
            <bitfield mask="0x00040000" name="ADCD23IE" />
            <bitfield mask="0x00080000" name="ADCD24IE" />
            <bitfield mask="0x00100000" name="ADCD25IE" />
            <bitfield mask="0x00200000" name="ADCD26IE" />
            <bitfield mask="0x00400000" name="ADCD27IE" />
            <bitfield mask="0x00800000" name="ADCD28IE" />
            <bitfield mask="0x01000000" name="ADCD29IE" />
            <bitfield mask="0x02000000" name="ADCD30IE" />
            <bitfield mask="0x04000000" name="ADCD31IE" />
            <bitfield mask="0x08000000" name="ADCD32IE" />
            <bitfield mask="0x10000000" name="ADCD33IE" />
            <bitfield mask="0x20000000" name="ADCD34IE" />
            <bitfield mask="0x40000000" name="ADCD35IE" />
            <bitfield mask="0x80000000" name="ADCD36IE" />
         </register>
