Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/atdf/PIC32MZ2025DAA176.atdf
         <register caption="" name="SBT1RD2" offset="0x470" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1RD2__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1RD2__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1RD2__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1RD2__GROUP3" />
         </register>
         <register caption="" name="SBT1RD3" offset="0x490" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1RD3__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1RD3__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1RD3__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1RD3__GROUP3" />
         </register>
         <register caption="" name="SBT1RD4" offset="0x4b0" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1RD4__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1RD4__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1RD4__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1RD4__GROUP3" />
         </register>
         <register caption="" name="SBT1RD5" offset="0x4d0" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1RD5__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1RD5__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1RD5__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1RD5__GROUP3" />
         </register>
         <register caption="" name="SBT1RD6" offset="0x4f0" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1RD6__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1RD6__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1RD6__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1RD6__GROUP3" />
         </register>
         <register caption="" name="SBT1RD7" offset="0x510" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1RD7__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1RD7__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1RD7__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1RD7__GROUP3" />
         </register>
         <register caption="" name="SBT1RD8" offset="0x530" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1RD8__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1RD8__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1RD8__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1RD8__GROUP3" />
         </register>
         <register caption="" name="SBT2RD0" offset="0x830" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT2RD0__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT2RD0__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT2RD0__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT2RD0__GROUP3" />
         </register>
         <register caption="" name="SBT2RD1" offset="0x850" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT2RD1__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT2RD1__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT2RD1__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT2RD1__GROUP3" />
         </register>
         <register caption="" name="SBT2RD2" offset="0x870" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT2RD2__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT2RD2__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT2RD2__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT2RD2__GROUP3" />
         </register>
         <register caption="" name="SBT3RD0" offset="0xc30" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT3RD0__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT3RD0__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT3RD0__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT3RD0__GROUP3" />
         </register>
         <register caption="" name="SBT3RD1" offset="0xc50" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT3RD1__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT3RD1__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT3RD1__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT3RD1__GROUP3" />
         </register>
         <register caption="" name="SBT3RD2" offset="0xc70" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT3RD2__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT3RD2__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT3RD2__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT3RD2__GROUP3" />
         </register>
         <register caption="" name="SBT4RD0" offset="0x1030" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT4RD0__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT4RD0__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT4RD0__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT4RD0__GROUP3" />
         </register>
